Revit 2027 API
NumberingFormatSettings.UppercaseCharacters Property
 if asCharacters is enabled, the characters will be presented as uppercase.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UppercaseCharacters { get; set; }
Public Property UppercaseCharacters As Boolean
	Get
	Set
public:
property bool UppercaseCharacters {
	bool get ();
	void set (bool value);
}
member UppercaseCharacters : bool with get, set
Property Value
Boolean
See Also
Reference
NumberingFormatSettings Class
Autodesk.Revit.DB Namespace